classwork/W7D2/app/controllers/api/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Morgan's a"], ["body", "God"], ["created_at", "2017-12-19 20:26:12.361279"], ["updated_at", "2017-12-19 20:26:12.361279"]]

  def update
    @todo = Todo.find(params[:id])
    if @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", "t"], ["updated_at", "2017-12-19 21:43:43.128275"], ["id", 1]]

  def destroy
    @todo = Todo.find(params[:id])
    if @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 12]]